InformationRegisters/EDR_Invoices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>EDR_Invoices</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDR_КатегорииСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИнвойса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Expense_code</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDR_ВидыРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/EDR_Invoices/Ext/ManagerModule.bsl
Функция ИнвойсыСуществуют(ЗаказНаряд) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

Функция СоздатьИнвойс(СтруктураПараметров) Экспорт
	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров,"ЗаказНаряд,Invoice","ДатаИнвойса");
	МЗ.Прочитать(); //Всегда считываем
	
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров);
	
	Если НЕ ЗначениеЗаполнено(МЗ.GUID) тогда //нужно добавить GUID
		GUID = Новый УникальныйИдентификатор();
		МЗ.GUID = Строка(GUID);
		
		МЗ.Записать(Истина);
	Иначе
		GUID = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	Возврат Строка(GUID);

	
КонецФункции

Функция ПолучитьИнвойс(Параметры) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	EDR_Invoices.Invoice,
	|	EDR_Invoices.ДатаИнвойса,
	|	EDR_Invoices.Категория
	|ИЗ
	|	РегистрСведений.EDR_Invoices КАК EDR_Invoices
	|ГДЕ
	|	EDR_Invoices.ЗаказНаряд = &ЗаказНаряд
	|	И EDR_Invoices.GUID = &GUID"
	);
	
	Запрос.УстановитьПараметр("ЗаказНаряд", Параметры["ЗаказНаряд"]);
	Запрос.УстановитьПараметр("GUID", Параметры["GUID"]);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтрокаСчет = "" + Выборка.Invoice + " от " + Формат(Выборка.ДатаИнвойса, "ДЛФ=D")+ ". Категория " 
					 + Выборка.Категория;
	Иначе
		СтрокаСчет = "Счет не найден";
	КонецЕсли;
	
	Возврат СтрокаСчет;
	
КонецФункции

Процедура ОбновитьИнвойс(СтруктураПараметров) Экспорт
	
	////$+ Комментарий 
	// Дата создания - 02.07.2012 15:29:26;
	// Автор - Окипний Андрей Евгеньевич
	//
	//При смене номера инвойса для повторной отправки во время записи происходит
	//дублирование записей. Потому что без номера инвойса нельзя считать существующую запись.
	//Поэтому делаем проверку на наличие символа P в пятой позиции.
	//Если такой символ есть - восстанавливаем старый номер Инвойса для поиска
	//
	//$-
	//Проверим Инвойс на повторную отправку
	НовИнвойс = СтруктураПараметров["Invoice"];
	
	ПятыйСимвол = Сред(НовИнвойс,5,1);
	
	Если ПятыйСимвол = "P" тогда //Нужно получить Старый номер
		ЗаказНаряд = СтруктураПараметров["ЗаказНаряд"];
		НомерЗаявкиПаттерн = EDR_КешируемыеЗначения.ПолучитьНомерДляПечати(ЗаказНаряд);
		
		ТекущийНомер = Прав(НомерЗаявкиПаттерн, 4) + "P";
		
		СтарыйНомер = СтрЗаменить(НовИнвойс, ТекущийНомер, НомерЗаявкиПаттерн);
	Иначе
		СтарыйНомер = НовИнвойс;
	КонецЕсли;
	
	//Помещаем старый инвойс в структуру
	СтруктураПараметров["Invoice"] = СтарыйНомер;
	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров,"ЗаказНаряд,Invoice, GUID","Категория,ДатаИнвойса,Expense_code");
	МЗ.Прочитать(); //Всегда считываем
	
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров);
	МЗ.Invoice = НовИнвойс;
	
	Если НЕ ЗначениеЗаполнено(МЗ.GUID) тогда //нужно добавить GUID
		GUID = Новый УникальныйИдентификатор();
		МЗ.GUID = Строка(GUID);
	КонецЕсли;
	
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьИнвойс(ИдентификаторИнвойса) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.GUID.Установить(ИдентификаторИнвойса);
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();

	
КонецПроцедуры

Функция ПолучитьЗаказНарядПоСчету(НомерСчета) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	EDR_Invoices.ЗаказНаряд
	|ИЗ
	|	РегистрСведений.EDR_Invoices КАК EDR_Invoices
	|ГДЕ
	|	EDR_Invoices.Invoice = &Invoice"
	);
	Запрос.УстановитьПараметр("Invoice",НомерСчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ЗаказНаряд;
КонецФункции

Процедура УдалитьЗаписиПоЗаказНаряду(ЗаказНаряд) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 тогда
		
		НЗ.Очистить();
		НЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
